Revit 2027 API
GroupTypeId.StructuralSectionGeometry Property
 Structural Section Geometry.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId StructuralSectionGeometry { get; }
Public Shared ReadOnly Property StructuralSectionGeometry As ForgeTypeId
	Get
public:
static property ForgeTypeId^ StructuralSectionGeometry {
	ForgeTypeId^ get ();
}
static member StructuralSectionGeometry : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
GroupTypeId Class
Autodesk.Revit.DB Namespace